DataProcessors/атл_ОтображениеТочекНаКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ОтображениеТочекНаКарте</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокТочек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/атл_НастройкиПодсистемыУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_НастройкиПодсистемыУМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогинОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьСинхронизацииССервером</Name>
					<Comment>Периодичность синхронизации с сервером в секундах (минимум 10 секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательДляВыполненияОбменаДанными</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованиеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийКлючШифрования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_КлючиШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФоновыйРежимОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщенияОПакетахОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьСтатистикуОбменов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПроверкаДанныхОВыполненныхРаботахВЗадачеМобильномуСотруднику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонЗаполненияЗадачМобильнымСотрудникам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_ШаблоныЗаполненияЗадачМобильнымСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУказанияДатыНазначенияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_СпособУказанияДатыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиротаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолготаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочекВебКлиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойЛогин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/атл_ОтображениеТочекНаКарте/Forms/ФормаОтображениеСтраницы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мВыгрузка = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	Объект.СписокТочек.Загрузить(мВыгрузка);
	
	ПолеHTMLДокумента = СформироватьАдресСсылки();
	
	ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();
	АдресСсылки = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
	
	Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен адрес карты для отображения точек! Отображение точек прервано!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;		
	
	Ном = 0;
	
	Для Каждого Стр из Объект.СписокТочек Цикл
		
		Если ПустаяСтрока(Стр.Широта) Или ПустаяСтрока(Стр.Долгота) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Некорректно заполнены координаты в строке " + Стр.НомерСтроки + "!";
			Сообщение.Поле = "Объект.СписокТочек[" + Стр.ПолучитьИдентификатор() + "].Широта";			
			Сообщение.Сообщить();			
			Продолжить;
		КонецЕсли;
		
		НС = Строка(Ном);
		
		АдресСсылки = АдресСсылки + ?(Ном=0, "?latitude", "&latitude") + НС + "=" + СокрЛП(Стр.Широта) + 
					"&longitude" + НС + "=" + СокрЛП(Стр.Долгота) + 
					"&header" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Заголовок)) +
				 	"&text" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Текст)) + 
					"&time" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Время)) + 
					"&color" + НС + "=" + СокрЛП(Стр.Цвет);
		
		Ном = Ном + 1;
	КонецЦикла;
	
	ПолеHTMLДокумента = АдресСсылки;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразоватьСимволы(URL)
    
    Результат = "";
    
    Для Сч = 1 По СтрДлина(URL) Цикл
        
        ch = Сред(URL,Сч,1);
        vch = КодСимвола(ch);
        
        Если ("A" <= ch ) И ( ch <= "Z") Тогда        // "A".."Z"
 
            Результат = Результат + ch;
			
        ИначеЕсли ("a" <= ch ) И ( ch <= "z") Тогда    // "a".."z"
 
            Результат = Результат + ch;
			
        ИначеЕсли ("0" <= ch ) И ( ch <= "9") Тогда    // "0".."9"
 
            Результат = Результат + ch;
			
        ИначеЕсли (ch = " ") ИЛИ ( ch = "+") Тогда            // space
 
            Результат = Результат + "+";
			
        ИначеЕсли (ch = "-" ) ИЛИ ( ch = "_") Тогда        // unreserved
 
            // ch == '.' || ch == '!'
 
            // ch == '~' || ch == '*'
 
            // ch == '\'' || ch == '('
 
            // ch == ')') Тогда
 
            Результат = Результат + ch;
			
        ИначеЕсли (vch <= 127) Тогда        // other ASCII
 
            Результат = Результат + hex(vch);
			
        ИначеЕсли (vch <= 2047) Тогда        // non-ASCII <= 0x7FF
 
            Результат = Результат + hex(192 + Цел(vch / 64));
            Результат = Результат + hex(128 + (vch % 64));
			
        Иначе                    // 0x7FF < ch <= 0xFFFF
 
            Результат = Результат + hex(224 + Цел(vch / 4096));
            Результат = Результат + hex(128 + (Цел(vch / 64) % 64));
            Результат = Результат + hex(128 + (vch % 64));
			
        КонецЕсли;
         
    КонецЦикла; 
    
    Возврат Результат;

КонецФункции // ()

&НаСервереБезКонтекста
Функция hex(Знач Значение) 
	
    Значение=Число(Значение);
	
	Если Значение <= 0 Тогда 
		
        Результат = "0";
		
	Иначе
		
        Значение = Цел(Значение);
        Результат = "";
        Пока Значение > 0 Цикл
            Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16 + 1,1)+Результат;
            Значение = Цел(Значение/16) ;
		КонецЦикла;
		
	КонецЕсли;
	
    Если СтрДлина(Результат) < 2 Тогда
    
        Результат = "0" + Результат;
    
	КонецЕсли; 
	
    Возврат "%" + Результат;
	
КонецФункции

&НаСервере
Функция СформироватьАдресСсылки()
	
	ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();
	АдресСсылки = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
	//АдресСсылки = "https://exchange.mobiforce.ru/map/maps.php";
	
	Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен адрес карты для отображения точек! Отображение точек прервано!";
		Сообщение.Сообщить();		
		Возврат "";
	КонецЕсли;		
	
	Ном = 0;
	
	Для Каждого Стр из Объект.СписокТочек Цикл
		
		Если ПустаяСтрока(Стр.Широта) И ПустаяСтрока(Стр.Долгота) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнены координаты в строке " + Стр.НомерСтроки + "!";
			Сообщение.Поле = "Объект.СписокТочек[" + Стр.ПолучитьИдентификатор() + "].Широта";			
			Сообщение.Сообщить();			
			Продолжить;
		ИначеЕсли ПустаяСтрока(Стр.Широта) Или ПустаяСтрока(Стр.Долгота) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Некорректно заполнены координаты в строке " + Стр.НомерСтроки + "!";
			Сообщение.Поле = "Объект.СписокТочек[" + Стр.ПолучитьИдентификатор() + "].Широта";			
			Сообщение.Сообщить();			
			Продолжить;
		КонецЕсли;
		
		НС = Строка(Ном);
		
		АдресСсылки = АдресСсылки + ?(Ном=0, "?latitude", "&latitude") + НС + "=" + СокрЛП(Стр.Широта) + 
					"&longitude" + НС + "=" + СокрЛП(Стр.Долгота) + 
					"&header" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Заголовок)) +
				 	"&text" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Текст)) + 
					"&time" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Время)) + 
					"&color" + НС + "=" + СокрЛП(Стр.Цвет);
		
		Ном = Ном + 1;
	КонецЦикла;
		
	Возврат АдресСсылки;

КонецФункции
